# -*- coding: utf-8 -*-
import polyglot
from polyglot.text import Text, Word


def print_hi(name):
    f = "He likes cars"
    f1 = "Це було не цікаве шоу, мені не сподобалося"
    f2 = "Він ненавидить яблука. Він байдуже ставиться до груш"
    f3 = "Підконтрольний окупаційній владі Євпаторійський міський суд засудив до року ув'язнення студента українського вишу, який створив у соцмережах групу про повернення окупованого Криму під контроль України. Йому закидають «створення екстремістської спільноти». Про це повідомила пресслужба «суду». Вирок отримав громадянин України, який є студентом геолого-географічного факультету одного з українських вишів. За даними «слідства», у 2018 році він створив у соціальній мережі групу, де розробив статут, структуру та символіку « екстремістської спільноти з метою повернення Республіки Крим та м. Севастополя під юрисдикцію України ». Його також звинуватили у вербуванні членів спільноти з-поміж жителів окупованого Криму та нібито закликах до вчинення протиправних дій. Як зазначає пресслужба підконтрольного РФ суду, студента затримали працівники ФСБ у 2020 році, коли той відвідував півострів. Там заявляють, що він «розкаявся у скоєному», бо « підпав під уплив групи українських студентів із радикально-націоналістичними переконаннями, а також пропаганди українських ЗМІ ». Студента засудили до року ув'язнення у виправній колонії загального режиму із забороною адмініструвати сайти та спільноти у соцмережах. У «суді» заявили, що такий вирок ухвалили, враховуючи низку пом'якшувальних обставин, зокрема стан здоров'я обвинуваченого. Повідомлення про рішення «суду» опублікували 21 травня, однак там само зазначили, що наразі вирок не набув чинності. У заяві також не було вказано імені обвинуваченого студента та, як зазначає «Крим.Реалії», немає коментарів його захисту. У вересні 2020 року «Крим.Реалії» з посиланням на власні джерела повідомляло , що ФСБ затримало в окупованому Криму 22-річного одесита Олександр Долженкова. Він геолог та навчався в Одеському національному університеті імені І.І. Мечникова. Олександр також має свій YouTube-канал , де він припинив публікувати відео саме у вересні. Чи це його засудили в окупованому Криму ㅡ наразі невідомо, адже ФСБ, Слідчий комітет Росії та адміністрацію СІЗО, де ймовірно перебував хлопець, не відповіли на запити."
    d = Text(f3)
    print(d.polarity)


if __name__ == '__main__':
    print_hi('PyCharm')
